интмаг/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Пастовщик</name>
    <type>
      <types>CatalogRef.Пастовщик</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

интмаг/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
Процедура ТоварыПриИзменении(Элемент)
    // 1. Получаем текущую строку табличной части
    ТекущаяСтрока = Элемент.ТекущиеДанные;
    
    // 2. Пересчитываем сумму для текущей строки
    Если ТекущаяСтрока <> Неопределено Тогда
        Если ТекущаяСтрока.Количество <> Неопределено 
            И ТекущаяСтрока.ЦенаЗакупки <> Неопределено Тогда
            ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаЗакупки;
        Иначе
            ТекущаяСтрока.Сумма = 0;
        КонецЕсли;
    КонецЕсли;
    
    // 3. Пересчитываем общую сумму документа
    СуммаДокумента = 0;
    Для Каждого Строка Из Элемент.Данные Цикл  // Используем Элемент.Данные вместо глобального "Товары"
        Если Строка.Сумма <> Неопределено Тогда
            СуммаДокумента = СуммаДокумента + Строка.Сумма;
        КонецЕсли;
    КонецЦикла;
    
    // 4. Обновляем реквизит документа (не элемент формы!)
    Объект.Сумма = СуммаДокумента;
КонецПроцедуры
